In [34]:
import pandas as pd

In [101]:
animals = pd.read_csv("C://Users//Zedstar//Documents//Coding//Python//Data//animals.csv")
titanic = pd.read_excel("C://Users//Zedstar//Documents//Coding//Python//Data//titanic.xlsx")

In [35]:
#a.Remember the exercise in Chapter 10 where you converted from Celsius 
#to Fahrenheit? Let’s create a function that does this for us, 
#which we can reuse! Using the equation below, 
#create a function that performs this task.

#C=5/9(F-32)

#Expected outputs (these are rounded, you don’t need to worry about that for now):
#•fahrenheit_to_degrees_celsius(32) returns: 0
#•fahrenheit_to_degrees_celsius(11) returns: -11.7
#•fahrenheit_to_degrees_celsius(81.3) returns: 27.4

#b.Update your function so it rounds to 1 decimal place.

In [36]:
def fahrenheit_to_degrees_celcius(celcius_value, = 5/9(fahrenheit_value-32)):
    total = celcius_value = 5/9(fahrenheit_value,-32)
    return total 

#incorrect funtion code

SyntaxError: invalid syntax (756837003.py, line 1)

In [37]:
def fahrenheit_to_degrees_celcius(degrees_f):
    degrees_c = (5/9)*(degrees_f-32)
    return degrees_c

In [38]:
fahrenheit_to_degrees_celcius(degrees_f=81.3)

27.38888888888889

In [39]:
fahrenheit_to_degrees_celcius(degrees_f=500)

260.0

In [40]:
fahrenheit_to_degrees_celcius(degrees_f=115)

46.111111111111114

In [41]:
def fahrenheit_to_degrees_celcius(degrees_f):
    degrees_c = (5/9)*(degrees_f-32)
    return round(degrees_c, 1)

In [42]:
fahrenheit_to_degrees_celcius(degrees_f=115)

46.1

In [43]:
fahrenheit_to_degrees_celcius(degrees_f=32)

0.0

In [44]:
fahrenheit_to_degrees_celcius(degrees_f=-11.7)

-24.3

In [45]:
fahrenheit_to_degrees_celcius(degrees_f=27.4)

-2.6

In [46]:
def round1_fahrenheit_to_degrees_c(degrees_f):
    degrees_c = (5/9)*(degrees_f-32)
    rounded_c = round(degrees_c, 1)
    return rounded_c 

#another way to round

In [47]:
round1_fahrenheit_to_degrees_c(degrees_f=500)

#when tring to  return the output remove the colon!!!!

260.0

In [48]:
fahrenheit_to_degrees_celcius(degrees_f=109)

42.8

In [49]:
fahrenheit_temperature = 68

celsius_temperature = round1_fahrenheit_to_degrees_c(fahrenheit_temperature)

print(f"{fahrenheit_temperature} degrees Fahrenheit is approximately {celsius_temperature} degrees Celsius.")

#uisng chat GPT to help output this function
#def round1_fahrenheit_to_degrees_c(degrees_f):
 #   degrees_c = (5/9)*(degrees_f-32)
  #  rounded_c = round(degrees_c, 1)
   # return rounded_c

68 degrees Fahrenheit is approximately 20.0 degrees Celsius.

In [50]:
def solo_degrees_c_from_degrees_f(degrees_f):
    degrees_c = (5/9)*(degrees_f-32)
    return degrees_c

#my written function converting degrees celcius from degrees fahrenheit
#without a guide

In [51]:
solo_degrees_c_from_degrees_f(degrees_f=345)

173.88888888888889

In [90]:
def rnd1_degrees_c_from_degrees_f(degrees_f):
    degrees_c = (5/9)*(degrees_f-32)
    return round(degrees_c, 1)

In [95]:
rnd1_degrees_c_from_degrees_f(degrees_f=32)

0.0

In [96]:
rnd1_degrees_c_from_degrees_f(degrees_f=11)

-11.7

In [97]:
rnd1_degrees_c_from_degrees_f(degrees_f=81.3)

27.4

In [94]:
def sequence(value_1=1, value_2=1, value_3=1):
    total = ((value_1**2)+value_2)/value_3
    return round(total, ndigits = 2)
    
 #to square a number, you do e.g. 5**2 use the pow() function, not 5^2

In [57]:
sequence(value_1=5, value_2=3, value_3=4)

7.0

In [58]:
sequence()

#default function

2.0

In [59]:
sequence(value_2=5, value_3=2)

#function with names specified (partly)

3.0

In [60]:
sequence(2,3,4)

#function with no names specified (fully)
#(Don't need to specify names but good practice dictates you should)

1.75

In [61]:
"""hello, I want to talk"""

'hello, I want to talk'

In [62]:
#In the previous exercise you created the sum_square_divide function.
#Recreate it here but with a docstring including the following:

#•Definition
#•Parameters (and their default values)
#•What it returns
#•One example of the default
#•One example with no named parameters
#•One example with two of the three parameters (with names)

In [63]:
#def square_sum_divide(val_1 = 1, val_2 = 1, val_3 = 1):
 # """
  #This function will square the first value (raise to the power of 2) and add it to the second value. Then this resultant sum will be divided by the third value.
  
 # Parameters
  #----------
  #val_1: A numeric value with default value 1.
  #val_2: A numeric value with default value 1.
  #val_3: A numeric value with default value 1.
  
  #Returns
  #-------
  #expression: The formula ((val_1 ** 2) + val_2)/val_3 is computed.
  
  #Examples
  #--------
  #square_sum_divide()
  #returns 2
  
  #square_sum_divide(2, 3, 4)
  #returns 1.75
  
  #square_sum_divide(val_2 = 5, val_3 = 2)
  #returns 3
  
  #Note that we cannot use strings in this function as they are incompatible with exponentiation and division.
  
  #"""
  #expression = ((val_1 ** 2) + val_2) / val_3
  #return round(expression, ndigits = 2)

In [64]:
def sequence(value_1=1, value_2=1, value_3=1):
    """This function squares the first value, then it is added to the second value and then the sum is divided by the third value 
    
    Parameters
    value_1: 1
    value_2: 1
    value_3: 1
    
    Returns
    The sum of the total sequence 
    
    """
    total = ((value_1**2)+value_2)/value_3
    return round(total, ndigits = 3)


#This is me making my own docstring

In [65]:
sequence()

2.0

In [66]:
sequence(1,4,6)

0.833

In [67]:
sequence(value_1=1,value_2=6)
#value_3 remains the default in the function

7.0

In [68]:
def whos_the_best(print_x_times):
    for each_num in range(print_x_times):
        print("Jesus the Lord loves you!")
        
whos_the_best(10)

Jesus the Lord loves you!
Jesus the Lord loves you!
Jesus the Lord loves you!
Jesus the Lord loves you!
Jesus the Lord loves you!
Jesus the Lord loves you!
Jesus the Lord loves you!
Jesus the Lord loves you!
Jesus the Lord loves you!
Jesus the Lord loves you!

In [69]:
def whos_the_best(print_x_times):
for each_num in range(print_x_times):
        print("Jesus is Lord!")
        
whos_the_best(10)

#this will give an error because the second line is not indented
#propely

IndentationError: expected an indented block (1489593085.py, line 2)

In [70]:
number_range = range(1,31)

for each_number in number_range:
    if (each_number % 3 == 0) & (each_number % 5 == 0)
    print("FizzBuzz")
    
    elif (each_number % 3 == 0)
    print("Fizz")
    
    elif (each_number % 5 == 0)
    print("Buzz")
    
    else 
    print(each_number)
    
#Error occurs because the lines aren't indented using the tab function
#Also colons are missing at the end of lines

SyntaxError: invalid syntax (3456624219.py, line 4)

In [71]:
number_range = range(1,31)

for each_number in number_range:
    if (each_number % 3 == 0) & (each_number % 5 == 0):
        print("FizzBuzz")
    
    elif (each_number % 3 == 0):
        print("Fizz")
    
    elif (each_number % 5 == 0):
        print("Buzz")
    
    else:
        print(each_number)
        
#% means divisible by I guess.

1
2
Fizz
4
Buzz
Fizz
7
8
Fizz
Buzz
11
Fizz
13
14
FizzBuzz
16
17
Fizz
19
Buzz
Fizz
22
23
Fizz
Buzz
26
Fizz
28
29
FizzBuzz

In [72]:
x = lambda a : print(a)

In [73]:
x(4)

4

In [74]:
#Remember our lovely problem from before? 
#Squaring the first number, adding it to the second 
#and then dividing the sum by the third? Let’s create 
#a lambda function that does just that! Make sure 
#it rounds to 2 decimal places as well.
#Use the examples (1, 2, 3) and (23, 24, 25) to check it.


x = lambda a,b,c : ((a**2)+b)/c 

x(1,2,3)

1.0

In [75]:
x = lambda a,b,c : ((a**2)+b)/c 

x(23,24,25)

22.12

In [76]:
x = lambda a,b,c : ((a**2)+b)/c 

x = round(1,2,3)

#me trying to round myself

TypeError: round() takes at most 2 arguments (3 given)

In [77]:
x = lambda a,b,c : round(((a**2)+b)/c, ndigits = 2)

x(1,2,3)

#correct rounding

1.0

In [78]:
x(23,24,25)

22.12

In [102]:
animals_new = animals.copy()

In [103]:
animals_new.columns = animals_new.columns.str.replace(" ","_")
#Replacing column spaces with "_"

In [104]:
animals_new.columns = animals_new.columns.str.lower()
animals_new_objects = animals_new.select_dtypes(["O"])
animals_new_objects
#lowecase the column names

,incidentnumber,datetimeofcall,finyear,typeofincident,finaldescription,animalgroupparent,propertytype,specialservicetypecategory,specialservicetype,borough,stngroundname,animalclass,code,london
0,139091,01/01/2009 03:01,2008/09,Special Service,"DOG WITH JAW TRAPPED IN MAGAZINE RACK,B15",Dog,House - single occupancy,Other animal assistance,Animal assistance involving livestock - Other ...,Croydon,Norbury,Mammal,00AH,Outer London
1,275091,01/01/2009 08:51,2008/09,Special Service,"ASSIST RSPCA WITH FOX TRAPPED,B15",Fox,Railings,Other animal assistance,Animal assistance involving livestock - Other ...,Croydon,Woodside,Mammal,00AH,Outer London
2,2075091,04/01/2009 10:07,2008/09,Special Service,"DOG CAUGHT IN DRAIN,B15",Dog,Pipe or drain,Animal rescue from below ground,Animal rescue from below ground - Domestic pet,Sutton,Wallington,Mammal,00BF,Outer London
3,2872091,05/01/2009 12:27,2008/09,Special Service,"HORSE TRAPPED IN LAKE,J17",Horse,"Intensive Farming Sheds (chickens, pigs etc)",Animal rescue from water,Animal rescue from water - Farm animal,Hillingdon,Ruislip,Mammal,00AS,Outer London
4,3553091,06/01/2009 15:23,2008/09,Special Service,"RABBIT TRAPPED UNDER SOFA,B15",Rabbit,House - single occupancy,Other animal assistance,Animal assistance involving livestock - Other ...,Havering,Harold Hill,Mammal,00AR,Outer London
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5747,138718-29092018,29/09/2018 14:57,2018/19,Special Service,ASSIST RSPCA WITH CAT STUCK ON WINDOW LEDGE 3 ...,Cat,Purpose Built Flats/Maisonettes - 4 to 9 storeys,Animal rescue from height,Animal rescue from height - Domestic pet,Hammersmith And Fulham,Chiswick,Mammal,00AN,NaN
5748,138738-29092018,29/09/2018 15:13,2018/19,Special Service,CAT STUCK ON 2ND FLOOR OF PROPERTY ASSIST...,Cat,Animal harm outdoors,Animal rescue from height,Animal rescue from height - Domestic pet,Waltham Forest,Walthamstow,Mammal,00BH,NaN
5749,138800-29092018,29/09/2018 16:49,2018/19,Special Service,CAT TRAPPED IN BUSHES ON LAKE,Cat,Lake/pond/reservoir,Animal rescue from water,Animal rescue from water - Domestic pet,Bromley,Bromley,Mammal,00AF,NaN
5750,138957-29092018,29/09/2018 21:10,2018/19,Special Service,DOG WITH PAWS TRAPPED IN METAL TABLE LEG,Dog,House - single occupancy,Other animal assistance,Assist trapped domestic animal,Ealing,Southall,Mammal,00AJ,NaN
5751,139509-30092018,30/09/2018 21:39,2018/19,Special Service,CAT STUCK ON ROOF OF HOUSE,Cat,Bungalow - single occupancy,Animal rescue from height,Animal rescue from height - Domestic pet,Barnet,Southgate,Mammal,00AC,NaN

In [105]:
animals
#orginal dataframe without column names

,IncidentNumber,DateTimeOfCall,CalYear,FinYear,TypeOfIncident,PumpCount,PumpHoursTotal,HourlyNominalCost(£),IncidentNominalCost(£),FinalDescription,AnimalGroupParent,PropertyType,SpecialServiceTypeCategory,SpecialServiceType,Borough,StnGroundName,AnimalClass,Code,London
0,139091,01/01/2009 03:01,2009,2008/09,Special Service,1.0,2.0,255,510.0,"DOG WITH JAW TRAPPED IN MAGAZINE RACK,B15",Dog,House - single occupancy,Other animal assistance,Animal assistance involving livestock - Other ...,Croydon,Norbury,Mammal,00AH,Outer London
1,275091,01/01/2009 08:51,2009,2008/09,Special Service,1.0,1.0,255,255.0,"ASSIST RSPCA WITH FOX TRAPPED,B15",Fox,Railings,Other animal assistance,Animal assistance involving livestock - Other ...,Croydon,Woodside,Mammal,00AH,Outer London
2,2075091,04/01/2009 10:07,2009,2008/09,Special Service,1.0,1.0,255,255.0,"DOG CAUGHT IN DRAIN,B15",Dog,Pipe or drain,Animal rescue from below ground,Animal rescue from below ground - Domestic pet,Sutton,Wallington,Mammal,00BF,Outer London
3,2872091,05/01/2009 12:27,2009,2008/09,Special Service,1.0,1.0,255,255.0,"HORSE TRAPPED IN LAKE,J17",Horse,"Intensive Farming Sheds (chickens, pigs etc)",Animal rescue from water,Animal rescue from water - Farm animal,Hillingdon,Ruislip,Mammal,00AS,Outer London
4,3553091,06/01/2009 15:23,2009,2008/09,Special Service,1.0,1.0,255,255.0,"RABBIT TRAPPED UNDER SOFA,B15",Rabbit,House - single occupancy,Other animal assistance,Animal assistance involving livestock - Other ...,Havering,Harold Hill,Mammal,00AR,Outer London
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5747,138718-29092018,29/09/2018 14:57,2018,2018/19,Special Service,1.0,1.0,333,333.0,ASSIST RSPCA WITH CAT STUCK ON WINDOW LEDGE 3 ...,Cat,Purpose Built Flats/Maisonettes - 4 to 9 storeys,Animal rescue from height,Animal rescue from height - Domestic pet,Hammersmith And Fulham,Chiswick,Mammal,00AN,NaN
5748,138738-29092018,29/09/2018 15:13,2018,2018/19,Special Service,NaN,NaN,333,NaN,CAT STUCK ON 2ND FLOOR OF PROPERTY ASSIST...,Cat,Animal harm outdoors,Animal rescue from height,Animal rescue from height - Domestic pet,Waltham Forest,Walthamstow,Mammal,00BH,NaN
5749,138800-29092018,29/09/2018 16:49,2018,2018/19,Special Service,1.0,1.0,333,333.0,CAT TRAPPED IN BUSHES ON LAKE,Cat,Lake/pond/reservoir,Animal rescue from water,Animal rescue from water - Domestic pet,Bromley,Bromley,Mammal,00AF,NaN
5750,138957-29092018,29/09/2018 21:10,2018,2018/19,Special Service,1.0,1.0,333,333.0,DOG WITH PAWS TRAPPED IN METAL TABLE LEG,Dog,House - single occupancy,Other animal assistance,Assist trapped domestic animal,Ealing,Southall,Mammal,00AJ,NaN
5751,139509-30092018,30/09/2018 21:39,2018,2018/19,Special Service,1.0,1.0,333,333.0,CAT STUCK ON ROOF OF HOUSE,Cat,Bungalow - single occupancy,Animal rescue from height,Animal rescue from height - Domestic pet,Barnet,Southgate,Mammal,00AC,NaN

In [106]:
def clean_frame_give_objects(dataframe):
    
    dataframe.columns = dataframe.columns.str.replace(" " , "_")
    dataframe.columns = dataframe.columns.str.lower()
    dataframe_objects = dataframe.select_dtypes(include = ["O"] )

    return dataframe_objects

#the function steps seems to be>>> define function 
#>>>replace the dataframe columsn with a gap to an underscore 
#>>>Make all column names lowercase
#>>>Then apply it to all object data in the column name sections 
#>>>Return the apply step 
#>>>The cell below shows how after defining the function,
#it's process can be applied to any other dataframe

In [107]:
clean_frame_give_objects(animals)

#the function here does the same as the script above
#the function can also be applied to any dataframe

,incidentnumber,datetimeofcall,finyear,typeofincident,finaldescription,animalgroupparent,propertytype,specialservicetypecategory,specialservicetype,borough,stngroundname,animalclass,code,london
0,139091,01/01/2009 03:01,2008/09,Special Service,"DOG WITH JAW TRAPPED IN MAGAZINE RACK,B15",Dog,House - single occupancy,Other animal assistance,Animal assistance involving livestock - Other ...,Croydon,Norbury,Mammal,00AH,Outer London
1,275091,01/01/2009 08:51,2008/09,Special Service,"ASSIST RSPCA WITH FOX TRAPPED,B15",Fox,Railings,Other animal assistance,Animal assistance involving livestock - Other ...,Croydon,Woodside,Mammal,00AH,Outer London
2,2075091,04/01/2009 10:07,2008/09,Special Service,"DOG CAUGHT IN DRAIN,B15",Dog,Pipe or drain,Animal rescue from below ground,Animal rescue from below ground - Domestic pet,Sutton,Wallington,Mammal,00BF,Outer London
3,2872091,05/01/2009 12:27,2008/09,Special Service,"HORSE TRAPPED IN LAKE,J17",Horse,"Intensive Farming Sheds (chickens, pigs etc)",Animal rescue from water,Animal rescue from water - Farm animal,Hillingdon,Ruislip,Mammal,00AS,Outer London
4,3553091,06/01/2009 15:23,2008/09,Special Service,"RABBIT TRAPPED UNDER SOFA,B15",Rabbit,House - single occupancy,Other animal assistance,Animal assistance involving livestock - Other ...,Havering,Harold Hill,Mammal,00AR,Outer London
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5747,138718-29092018,29/09/2018 14:57,2018/19,Special Service,ASSIST RSPCA WITH CAT STUCK ON WINDOW LEDGE 3 ...,Cat,Purpose Built Flats/Maisonettes - 4 to 9 storeys,Animal rescue from height,Animal rescue from height - Domestic pet,Hammersmith And Fulham,Chiswick,Mammal,00AN,NaN
5748,138738-29092018,29/09/2018 15:13,2018/19,Special Service,CAT STUCK ON 2ND FLOOR OF PROPERTY ASSIST...,Cat,Animal harm outdoors,Animal rescue from height,Animal rescue from height - Domestic pet,Waltham Forest,Walthamstow,Mammal,00BH,NaN
5749,138800-29092018,29/09/2018 16:49,2018/19,Special Service,CAT TRAPPED IN BUSHES ON LAKE,Cat,Lake/pond/reservoir,Animal rescue from water,Animal rescue from water - Domestic pet,Bromley,Bromley,Mammal,00AF,NaN
5750,138957-29092018,29/09/2018 21:10,2018/19,Special Service,DOG WITH PAWS TRAPPED IN METAL TABLE LEG,Dog,House - single occupancy,Other animal assistance,Assist trapped domestic animal,Ealing,Southall,Mammal,00AJ,NaN
5751,139509-30092018,30/09/2018 21:39,2018/19,Special Service,CAT STUCK ON ROOF OF HOUSE,Cat,Bungalow - single occupancy,Animal rescue from height,Animal rescue from height - Domestic pet,Barnet,Southgate,Mammal,00AC,NaN

In [108]:
#We could also expand this loop to allow us to perform the function
#on multiple DataFrames. 
#This would allow us to clean multiple DataFrames at once
#and store them in a list object for example.

# We can then loop through the list of frames and process them one after another
# Collect our list of frames
list_of_frames = [animals, titanic]

# Create a new blank list to store our frames in
new_frames = []

# Use a for loop to apply our function
for each_frame in list_of_frames:
    clean_frame = clean_frame_give_objects(each_frame)
    new_frames.append(clean_frame)    

    
#the clean_frame_give_objects function
#from def clean_frame_give_objects(dataframe), is utilised

In [109]:
#We can then sub-select each DataFrame from our list like so:
# selects the datafame at position 0 in our list
new_frames[0].head()

,incidentnumber,datetimeofcall,finyear,typeofincident,finaldescription,animalgroupparent,propertytype,specialservicetypecategory,specialservicetype,borough,stngroundname,animalclass,code,london
0,139091,01/01/2009 03:01,2008/09,Special Service,"DOG WITH JAW TRAPPED IN MAGAZINE RACK,B15",Dog,House - single occupancy,Other animal assistance,Animal assistance involving livestock - Other ...,Croydon,Norbury,Mammal,00AH,Outer London
1,275091,01/01/2009 08:51,2008/09,Special Service,"ASSIST RSPCA WITH FOX TRAPPED,B15",Fox,Railings,Other animal assistance,Animal assistance involving livestock - Other ...,Croydon,Woodside,Mammal,00AH,Outer London
2,2075091,04/01/2009 10:07,2008/09,Special Service,"DOG CAUGHT IN DRAIN,B15",Dog,Pipe or drain,Animal rescue from below ground,Animal rescue from below ground - Domestic pet,Sutton,Wallington,Mammal,00BF,Outer London
3,2872091,05/01/2009 12:27,2008/09,Special Service,"HORSE TRAPPED IN LAKE,J17",Horse,"Intensive Farming Sheds (chickens, pigs etc)",Animal rescue from water,Animal rescue from water - Farm animal,Hillingdon,Ruislip,Mammal,00AS,Outer London
4,3553091,06/01/2009 15:23,2008/09,Special Service,"RABBIT TRAPPED UNDER SOFA,B15",Rabbit,House - single occupancy,Other animal assistance,Animal assistance involving livestock - Other ...,Havering,Harold Hill,Mammal,00AR,Outer London

In [110]:
# selects the datafame at position 1 in our list
new_frames[1].head()

,name,sex,ticket,cabin,embarked,home.dest,boat
0,"Allen, Miss. Elisabeth Walton",female,24160,B5,S,"St Louis, MO",2
1,"Allison, Master. Hudson Trevor",male,113781,C22 C26,S,"Montreal, PQ / Chesterville, ON",11
2,"Allison, Miss. Helen Loraine",female,113781,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN
3,"Allison, Mr. Hudson Joshua Creighton",male,113781,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,113781,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN

In [111]:
#looping through a list of dataframes may not always be 
#the most efficient way to accomplish something 
#when the dfs themselves are particularly large and there is a large
#number of them. Generally this would be considered bad practice


#The map() function allows us to apply a specified function of our 
#choice to an iterable (so a list or tuple for example) to circumvent 
#the need for looping (and as such is much faster), 
#creating what is called a map object.

#This may sound like it could be a problem, but thankfully, 
#we have the list() function to covert this back to a list, 
#so we must remember to convert the datatype as a final step. 

#Often a loop should be used as a last resort for this kind of 
#application if such a function as map() is not applicable.


#The syntax for map is as follows:
#map(function, iterable)
#Where the function is a UDF or a built in function and the 
#iterable is the list, tuple etc of our choice!

In [ ]:
#world of functional programming can be its own discipline within programming 
#something that the programming language R was built for 
#but is now possible in Python

#the cleaning function performs two tasks in one, namely:
#>>>Cleaning column names
#>>>Selecting object datatypes

#This was done for convenience here and to show a good 
#example of using functions for dataframes but is not good practice. 

#we should always strive to make functions as simple as possible 
#performing only one task each unless impossible to separate them.

#we should create a smaller function to clean the column names, 
#outputting a dataframe that can then be passed to 
#an object selector function and so on in a pipeline.